package com.sist.manager;
// 데이터 수집 : 웹크롤링 
// 사이트를 연결해서 데이터 읽기 => HTML Parser (Jsoup:정적데이터) 
// 동적 (실시간) => 셀레니움 
// 영화 , 뮤직 => 동영상 (유티브)
/*
 *    사이트 : 
 *            결재(장바구니) 10000개의 레시피 (스토어) 
 *            추천 (경로) : 망고플레이트 , 서울 여행(명소, 자연 , 호텔,쇼핑몰...)
 *            예매 : 영화 (네이버) , 맛집(망고플레이트)
 *                 -----  ----
 *            레시피 만드는 방법 : 냉장고(재료) => 재료 선택시 => 레시피(추천)
 *            => 화면 UI + SQL => 채팅 (챗봇)
 *            => 기능 추가 (스프링) => 실제 챗봇
 *            => 최신 기술 (스프링부트 , React,Vue)
 *                                  ----------- Rest API   
 */
public class FoodManager {

}
